"""
Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей. Дано a, b, c —
стороны предполагаемого треугольника. Требуется сравнить длину каждого отрезка-стороны с суммой
двух других. Если хотя бы в одном случае отрезок окажется больше суммы двух других, то треугольника
с такими сторонами не существует. Отдельно сообщить является ли треугольник разносторонним,
равнобедренным или равносторонним.
"""

print('Введите стороны треугольника')
a = int(input('сторона a = '))
b = int(input('сторона b = '))
c = int(input('сторона c = '))

if a <= 0 or b <= 0 or c <= 0:
    print('Сторона(ы) должна(ы) быть больше нуля')
else:
    if a + b > c and a + c > b and b + c > a:
        print("Треугольник существует")
        if a == b == c:
            print("Треугольник равносторонний")
        elif a == b or a == c or b == c:
            print("Треугольник равнобедренный")
        else:
            print("Треугольник разносторонний")
    else:
        print("Треугольник не существует")
